api/test/fixtures/soap/expected-requests/simple-object.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://www.examples.com/wsdl/HelloService.wsdl" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Body>
    <tns:sayHello>
      <firstName>John</firstName>
      <lastName>Doe</lastName>
    </tns:sayHello>
  </soap:Body>
</soap:Envelope>
