hello-request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <sayHello xmlns="http://www.examples.com/wsdl/HelloService.wsdl">
      <firstName>mamund</firstName>
    </sayHello>
  </Body>
</Envelope>
